## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:46" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:46" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:fba6a818d481fa3160a20583ec5304fa5606a52ef0c62687a3009341bfa140cb" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:bd41da1962a2afd7075b89e49d557cff8481a296f92012b5b61c1f57997b9f56"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 46 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
        id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                   = {}
      ~ version_id             = "CLqstSbaml6tMljkzlqY0bVmh7gxcVLg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "f12d747e0b78b872f335428cbff9a31b"
        id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                   = {}
      ~ version_id             = "VP00jvfOd2zkQ9UT4E.uzkerPro9SPKG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b008cd515b3b286b32f33b738233ed1b-6" -> "1e50aff424afada973d824af9d2a113f"
      ~ id                     = "graphql.abc833777b8a184bc51c0889bec3c00b.zip" -> (known after apply)
      ~ key                    = "graphql.abc833777b8a184bc51c0889bec3c00b.zip" -> "graphql.1e50aff424afada973d824af9d2a113f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "abc833777b8a184bc51c0889bec3c00b" -> "1e50aff424afada973d824af9d2a113f"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "RPrKZgy5n3fsMJudsC7j9kuQCQQimg9g" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "dd0d414346226e7e8b7ad1172178eba1" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/200.html"
      ~ source_hash            = "dd0d414346226e7e8b7ad1172178eba1" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "2Xms3XHaLn5WA7IA9Lx6KGhMmp.O.TuV" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "560f5c5963818aed3cb1316d4e59e82a" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "560f5c5963818aed3cb1316d4e59e82a" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        tags                   = {}
      ~ version_id             = "0FkEa6IXMIDsm8i.XqgAlTd1UgGBCFi6" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b9f92e2b843d34002fc87fd6769f6729" -> "efb4158acaee6a39e70d443d4cec84e4"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "b9f92e2b843d34002fc87fd6769f6729" -> "efb4158acaee6a39e70d443d4cec84e4"
        tags                   = {}
      ~ version_id             = "k6svGG_XQdxZeLgtfG4eXl4oPyzLY1yd" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "dd0d414346226e7e8b7ad1172178eba1" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/index.html"
      ~ source_hash            = "dd0d414346226e7e8b7ad1172178eba1" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "b1OSj4ifjcPkny6S1XpzvC7Knf4dCZqU" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.2bedcb6a.js"] will be destroyed
  # (because key ["static/js/app.2bedcb6a.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5fa3ee36eb4f96d4647d7061afc16e52" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.2bedcb6a.js" -> null
-       key                    = "dist/static/js/app.2bedcb6a.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.2bedcb6a.js" -> null
-       source_hash            = "5fa3ee36eb4f96d4647d7061afc16e52" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "inedL15IKr.keV9mk9Xsjfru3cux4D_Y" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.2bedcb6a.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.2bedcb6a.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.2bedcb6a.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.2bedcb6a.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.2bedcb6a.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "j1ShWtNYvKeeM_vT6GGuZLkC9sIJnRbm" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f15abf167ebcb6da979cb68ee9e19ffe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js"
+       source_hash            = "f15abf167ebcb6da979cb68ee9e19ffe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:15/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
              ~ "DD_TAGS"                      = "git.commit.sha:4cf3d15cbdd6422d676ebbaac1b10fe49daf4803,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:df1e67df9781078a7f33e09e26800fc799d00e23,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "15" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:15/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
              ~ "DD_TAGS"                      = "git.commit.sha:4cf3d15cbdd6422d676ebbaac1b10fe49daf4803,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:df1e67df9781078a7f33e09e26800fc799d00e23,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "15" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-02-06T21:49:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:62" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:62/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.abc833777b8a184bc51c0889bec3c00b.zip" -> "graphql.1e50aff424afada973d824af9d2a113f.zip"
        tags                           = {}
      ~ version                        = "62" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
              ~ "DD_TAGS"                            = "git.commit.sha:4cf3d15cbdd6422d676ebbaac1b10fe49daf4803,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:df1e67df9781078a7f33e09e26800fc799d00e23,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "4cf3d15cbdd6422d676ebbaac1b10fe49daf4803" -> "df1e67df9781078a7f33e09e26800fc799d00e23"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "62" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.reporting_data_bucket.aws_s3_bucket_cors_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_cors_configuration" "default" {
        id     = "cpfreporter-reportingdata-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

-       cors_rule {
-           allowed_headers = [
-               "*",
            ] -> null
-           allowed_methods = [
-               "GET",
-               "HEAD",
-               "POST",
-               "PUT",
            ] -> null
-           allowed_origins = [
-               "staging.cpf.usdr.dev",
            ] -> null
-           expose_headers  = [
-               "Content-Disposition",
-               "Content-Encoding",
-               "Content-Length",
-               "Content-Location",
-               "Content-Range",
-               "Date",
-               "ETag",
-               "Server",
-               "x-amz-delete-marker",
-               "x-amz-id-2",
-               "x-amz-request-id",
-               "x-amz-server-side-encryption",
-               "x-amz-version-id",
            ] -> null
-           max_age_seconds = 10 -> null
        }
+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
+               "HEAD",
+               "POST",
+               "PUT",
            ]
+           allowed_origins = [
+               "https://staging.cpf.usdr.dev",
            ]
+           expose_headers  = [
+               "Content-Disposition",
+               "Content-Encoding",
+               "Content-Length",
+               "Content-Location",
+               "Content-Range",
+               "Date",
+               "ETag",
+               "Server",
+               "x-amz-delete-marker",
+               "x-amz-id-2",
+               "x-amz-request-id",
+               "x-amz-server-side-encryption",
+               "x-amz-version-id",
            ]
+           max_age_seconds = 300
        }
    }

Plan: 7 to add, 11 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7819926344)*